tszabo-ro/esp32-robo-vacuum/sdkconfig.defaults
# ESP32-C3 Project Configuration
CONFIG_IDF_TARGET="esp32c3"

# C++ Configuration
#
# Both off, because neither is used: there is no try, catch, dynamic_cast or
# typeid anywhere in main/. Leaving them on cost flash and RAM for unwinding
# tables and type information that nothing reads, and bought nothing - an
# allocation failure ends in std::terminate with exceptions on and in abort with
# them off, which is the same reboot either way. The code that matters guards
# against that by capping what it allocates rather than by catching afterwards.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Console over USB-Serial/JTAG (ESP32-C3 SuperMini has no separate UART-USB chip)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Power. The controller runs off the robot's battery, so it is tuned for a
# device that idles most of the time rather than for throughput.
#
# 80MHz roughly halves dynamic CPU power. WiFi, TLS and the UART all still work;
# the visible cost is slower OTA downloads and marginally slower page loads.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y

# Keeps the WiFi sleep path in IRAM so each wake-up is shorter, which is where
# most of the radio's idle power goes.
CONFIG_ESP_WIFI_SLP_IRAM_OPT=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Web server: the debug interface streams logs over a WebSocket
CONFIG_HTTPD_WS_SUPPORT=y

# MQTT
CONFIG_MQTT_PROTOCOL_311=y

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32

# Memory
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Flash size (the SuperMini has 4MB embedded; a 2MB setting makes everything
# above 0x200000 unreachable, which leaves no room for a second OTA slot)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition Table: two OTA slots, see partitions.csv
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# OTA rollback: a freshly installed image boots as pending-verify and is
# reverted on the next restart unless the app confirms it is healthy.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# HTTPS OTA verifies the firmware host against the bundled root certificates,
# so no per-host certificate has to be embedded.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
